Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2025DAR169.atdf
         <register caption="" name="OFF177" offset="0x804" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF178" offset="0x808" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF179" offset="0x80c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF180" offset="0x810" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF181" offset="0x814" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF182" offset="0x818" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF183" offset="0x81c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF184" offset="0x820" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF185" offset="0x824" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF186" offset="0x828" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF187" offset="0x82c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF188" offset="0x830" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF189" offset="0x834" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF190" offset="0x838" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF191" offset="0x83c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF192" offset="0x840" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF193" offset="0x844" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF195" offset="0x84c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF196" offset="0x850" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF197" offset="0x854" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF198" offset="0x858" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF199" offset="0x85c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF200" offset="0x860" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF201" offset="0x864" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF202" offset="0x868" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF203" offset="0x86c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF205" offset="0x874" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF206" offset="0x878" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF207" offset="0x87c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF208" offset="0x880" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF209" offset="0x884" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF210" offset="0x888" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF211" offset="0x8a4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF214" offset="0x898" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF215" offset="0x89c" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
      </register-group>
      <value-group caption="External Interrupt 0 Edge" name="INTCON__INT0EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 1 Edge" name="INTCON__INT1EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 2 Edge" name="INTCON__INT2EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 3 Edge" name="INTCON__INT3EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
      <value-group caption="External Interrupt 4 Edge" name="INTCON__INT4EP">
         <value caption="Rising edge" name="" value="0x1" />
         <value caption="Falling edge" name="" value="0x0" />
      </value-group>
