Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MZ-DA_DFP/1.1.98/atdf/PIC32MZ2025DAR169.atdf
         <register caption="SDHC Interrupt Signal Enable Register" name="SDHCINTSEN" offset="0x34" rw="RW" size="4">
            <bitfield mask="0x00000001" name="CCISE" />
            <bitfield mask="0x00000002" name="TXCISE" />
            <bitfield caption="Block Gap Interrupt Signal Enable bit" mask="0x00000004" name="BGISE" values="SDHCINTSEN__BGISE" />
            <bitfield caption="DMA Interrupt Signal Enable bit" mask="0x00000008" name="DMAISE" values="SDHCINTSEN__DMAISE" />
            <bitfield caption="Buffer Write Ready Interrupt Signal Enable bit" mask="0x00000010" name="BWRDYISE" values="SDHCINTSEN__BWRDYISE" />
            <bitfield caption="Buffer Read Ready Interrupt Signal Enable bit" mask="0x00000020" name="BRRDYISE" values="SDHCINTSEN__BRRDYISE" />
            <bitfield caption="Card Insertion Interrupt Signal Enable bit" mask="0x00000040" name="CARDIISE" values="SDHCINTSEN__CARDIISE" />
            <bitfield caption="Card Removal Interrupt Signal Enable bit" mask="0x00000080" name="CARDRISE" values="SDHCINTSEN__CARDRISE" />
            <bitfield caption="Card Interrupt Signal Enable bit" mask="0x00000100" name="CARDISE" values="SDHCINTSEN__CARDISE" />
            <bitfield mask="0x00008000" name="EISE" />
            <bitfield caption="Command Time-out Error Interrupt Signal Enable bit" mask="0x00010000" name="CTOEISE" values="SDHCINTSEN__CTOEISE" />
            <bitfield caption="Command CRC Error Interrupt Signal Enable bit" mask="0x00020000" name="CCRCEISE" values="SDHCINTSEN__CCRCEISE" />
            <bitfield caption="Command End Bit Error Interrupt Signal Enable bit" mask="0x00040000" name="CEBEISE" values="SDHCINTSEN__CEBEISE" />
            <bitfield caption="Command Index Error Interrupt Signal Enable bit" mask="0x00080000" name="CIDXEISE" values="SDHCINTSEN__CIDXEISE" />
            <bitfield caption="Data Time-out Error Interrupt Signal Enable bit" mask="0x00100000" name="DTOEISE" values="SDHCINTSEN__DTOEISE" />
            <bitfield caption="Data CRC Error Interrupt Signal Enable bit" mask="0x00200000" name="DCRCEISE" values="SDHCINTSEN__DCRCEISE" />
            <bitfield caption="Data End Bit Error Interrupt Signal Enable bit" mask="0x00400000" name="DEBEISE" values="SDHCINTSEN__DEBEISE" />
            <bitfield caption="Current-Limit Error Interrupt Signal Enable bit" mask="0x00800000" name="CLEISE" values="SDHCINTSEN__CLEISE" />
            <bitfield caption="Auto CMD12 Error Interrupt Signal Enable bit" mask="0x01000000" name="ACEISE" values="SDHCINTSEN__ACEISE" />
            <bitfield caption="ADMA Error Interrupt Signal Enable bit" mask="0x02000000" name="ADEISE" values="SDHCINTSEN__ADEISE" />
         </register>
         <register caption="SDHC Status Register 2" name="SDHCSTAT2" offset="0x38" rw="R" size="4">
            <bitfield caption="Auto CMD12 Not Executed bit" mask="0x00000001" name="ACNEXEC" values="SDHCSTAT2__ACNEXEC" />
            <bitfield caption="Auto CMD12 Time-out Error bit" mask="0x00000002" name="ACTOE" values="SDHCSTAT2__ACTOE" />
            <bitfield caption="Auto CMD12 CRC Error bit" mask="0x00000004" name="ACCRCE" values="SDHCSTAT2__ACCRCE" />
            <bitfield caption="Auto CMD12 End Bit Error bit" mask="0x00000008" name="ACEBE" values="SDHCSTAT2__ACEBE" />
            <bitfield caption="Auto CMD12 Index Error bit" mask="0x00000010" name="ACIDXE" values="SDHCSTAT2__ACIDXE" />
            <bitfield caption="Command Not Issued by Auto CMD12 Error bit" mask="0x00000080" name="CNISSE" values="SDHCSTAT2__CNISSE" />
         </register>
         <register caption="SDHC Capabilities Register" name="SDHCCAP" offset="0x3c" rw="R" size="4">
            <bitfield caption="Time-out Clock Frequency bits" mask="0x0000003F" name="TOCLKFREQ" values="SDHCCAP__TOCLKFREQ" />
            <bitfield caption="Time-out Clock Unit bit" mask="0x00000080" name="TOCLKU" values="SDHCCAP__TOCLKU" />
            <bitfield caption="Base Clock Frequency for SDCLK bits" mask="0x0000FF00" name="BASECLK" values="SDHCCAP__BASECLK" />
            <bitfield caption="Maximum Block Length bits" mask="0x000C0000" name="MBLEN" values="SDHCCAP__MBLEN" />
            <bitfield mask="0x00100000" name="BUS8BIT" />
            <bitfield caption="ADMA2 Support bit" mask="0x00200000" name="ADMA2" values="SDHCCAP__ADMA2" />
            <bitfield caption="High-speed Support bit" mask="0x00800000" name="HISPEED" values="SDHCCAP__HISPEED" />
            <bitfield caption="Suspend/Resume Support bit" mask="0x02000000" name="SRESUME" values="SDHCCAP__SRESUME" />
            <bitfield caption="3.3V Voltage Support bit" mask="0x04000000" name="VOLT3V3" values="SDHCCAP__VOLT3V3" />
            <bitfield mask="0x80000000" name="ASYNCINT" />
            <bitfield mask="0x300000000" name="SLOTTYPE" />
         </register>
         <register caption="SDHC Maximum Current Capabilities Register" name="SDHCMAXCAP" offset="0x44" rw="R" size="4">
            <bitfield caption="Maximum Current for 3.3V bits" mask="0x000000FF" name="MC3V3" values="SDHCMAXCAP__MC3V3" />
         </register>
         <register caption="SDHC Force Event Register" name="SDHCFE" offset="0x4c" rw="W" size="4">
            <bitfield caption="Force Event for Auto CMD12 Not Executed Error bit" mask="0x00000001" name="FEACNEE" values="SDHCFE__FEACNEE" />
            <bitfield caption="Force Event for Auto CMD12 Time-out Error bit" mask="0x00000002" name="FEACTOE" values="SDHCFE__FEACTOE" />
            <bitfield mask="0x00000004" name="FEACCRCE" />
            <bitfield caption="Force Event for Auto CMD12 End Bit Error bit" mask="0x00000008" name="FEACEBE" values="SDHCFE__FEACEBE" />
            <bitfield caption="Force Event for Auto CMD12 Index Error bit" mask="0x00000010" name="FEACIDXE" values="SDHCFE__FEACIDXE" />
            <bitfield caption="Force Event for Command Not Issued by Auto CMD12 Error bit" mask="0x00000080" name="FECNIACE" values="SDHCFE__FECNIACE" />
            <bitfield caption="Force Event for Command Time-out Error bit" mask="0x00010000" name="FECTOE" values="SDHCFE__FECTOE" />
            <bitfield caption="Force Event for Command CRC Error bit" mask="0x00020000" name="FECCRCE" values="SDHCFE__FECCRCE" />
            <bitfield caption="Force Event for Command End Bit Error bit" mask="0x00040000" name="FECEBE" values="SDHCFE__FECEBE" />
            <bitfield caption="Force Event for Command Index Error bit" mask="0x00080000" name="FEIDXE" values="SDHCFE__FEIDXE" />
            <bitfield caption="Force Event for Data Time-out Error bit" mask="0x00100000" name="FEDTOE" values="SDHCFE__FEDTOE" />
            <bitfield caption="Force Event for Data CRC Error bit" mask="0x00200000" name="FEDCRCE" values="SDHCFE__FEDCRCE" />
            <bitfield caption="Force Event for Data End Bit Error bit" mask="0x00400000" name="FEDEBE" values="SDHCFE__FEDEBE" />
            <bitfield caption="Force Event for Current-Limit Error bit" mask="0x00800000" name="FECLE" values="SDHCFE__FECLE" />
            <bitfield caption="Force Event for Auto CMD 12 Error bit" mask="0x01000000" name="FEACE" values="SDHCFE__FEACE" />
            <bitfield mask="0x02000000" name="FEAE" />
         </register>
         <register caption="" name="SDHCAESTAT" offset="0x50" rw="R" size="4">
            <bitfield mask="0x00000003" name="AERRST" />
            <bitfield mask="0x00000004" name="ALMERR" />
         </register>
         <register caption="SDHC ADMA Address Register" name="SDHCAADDR" offset="0x54" rw="RW" size="4">
            <bitfield mask="0xFFFFFFFF" name="ADDR" />
         </register>
      </register-group>
      <value-group caption="Transfer Block Size bits" name="SDHCBLKCON__BSIZE">
         <value caption="512 bytes" name="" value="0x200" />
         <value caption="511 bytes" name="" value="0x1ff" />
         <value caption="2 bytes" name="" value="0x2" />
         <value caption="1 byte" name="" value="0x1" />
         <value caption="No data transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Blocks Count for Current Transfer bits" name="SDHCBLKCON__BCOUNT">
         <value caption="65,535 blocks " name="" value="0x0" />
         <value caption="2 blocks" name="" value="0x0" />
         <value caption="1 block" name="" value="0x0" />
         <value caption="Stop count Blocks Count for Current Transfer bits" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Enable bit" name="SDHCMODE__DMAEN">
         <value caption="DMA (ADMA) is used to transfer data" name="" value="0x1" />
         <value caption="CPU is used to transfer data" name="" value="0x0" />
      </value-group>
      <value-group caption="Block Count Enable Bit" name="SDHCMODE__BCEN">
         <value caption="Block count is enabled" name="" value="0x1" />
         <value caption="Block count is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Auto CMD12 Enable bits" name="SDHCMODE__ACEN">
         <value caption="Reserved" name="" value="0x3" />
         <value caption="Reserved" name="" value="0x2" />
         <value caption="Auto CMD12 is enabled" name="" value="0x1" />
         <value caption="Auto CMD 12 is disabled" name="" value="0x0" />
      </value-group>
